Учет_работы/src/Documents/ВыполнениеРабот/ВыполнениеРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеРабот</name>
  <registerRecords>AccumulationRegister.ПредварительныйОборот</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныйОборот</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Учет_работы/src/AccumulationRegisters/ДенежныйОборот/ДенежныйОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныйОборот</name>
  <resources>
    <name>ОплаченнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Работы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_работы/src/AccumulationRegisters/ПредварительныйОборот/ПредварительныйОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПредварительныйОборот</name>
  <resources>
    <name>ПредварительнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Работы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_работы/src/Documents/ВыполнениеРабот/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Оплачено тогда
		Движения.ДенежныйОборот.Записывать = Истина;
		Движение = Движения.ДенежныйОборот.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Работы = ВидРабот;
		Движение.Заказчик = Заказчик;
		Движение.ОплаченнаяСумма = СуммаОплаты;
		Движение.ДатаОплаты = ДатаОплаты;
		НаборЗаписей = РегистрыНакопления.ПредварительныйОборот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать();
	Иначе
		// регистр ДенежныйОборот Приход
		Движения.ПредварительныйОборот.Записывать = Истина;
		Движение = Движения.ПредварительныйОборот.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Работы = ВидРабот;
		Движение.Заказчик = Заказчик;
		Движение.ПредварительнаяСумма = ПредварительнаяСумма;
		НаборЗаписей = РегистрыНакопления.ДенежныйОборот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать();

	КонецЕсли;
КонецПроцедуры
#КонецОбласти
